{
  "contact": {
    "title": "Contact",
    "key-title": "Get In Touch",
    "description": "Feel free if you've any question",
    "send-email": "Send E-mail",
    "resume": "Resume"
  },
  "content": {
    "title-1": "Experiences",
    "title-2": "Expertise"
  },
  "experiences": {
    "responsibility": "My responsibilities included:",
    "card-1": {
      "title": "MTL: Frontend (Full time) Mar 2023 - Apr 2024",
      "description": "The GISX project is the company’s core system for managing group insurance and is currently live in production. I contributed significantly to the frontend development, particularly in establishing the foundational architecture of the system. This high-impact project, valued at over 500 million baht, aimed to replace a legacy platform with a modern solution.",
      "res-1": "Designing and implementing a Micro Frontend architecture using Next.js and Module Federation, from initial R&D through to successful integration between server and client.",
      "res-2": "Leading the development of major frontend features and collaborating closely with both technical and business teams.",
      "res-3": "Acting as a technical consultant to the business unit, providing guidance on system trade-offs, feature feasibility, and strategic decisions.",
      "res-4": "Participating in weekly sync meetings to review code, ensure best practices, and maintain code quality across development cycles."
    },
    "card-2": {
      "title": "Shippop: Frontend (Contract) Jan 2022 - Feb 2023",
      "description": "Shippop Global is a product courier aggregator around the world to make transport parcels easier. I have role in Frontend developer. we work as Scrum, gathering requirement from PO, development in Next Js and build API Gateway via Nextjs, using version control of Azure DevOps and building CI/CD that contain Automate testing by Cypress and setting Infrastructure."
    },
    "card-3": {
      "title": "Shippop: Frontend (Cooperation Education) Aug 2021 - Nov 2021",
      "description": "All Express project is a product that drive by Multi level marketing business. this product was built for solving delivering a parcel. This product is as POS (Platform as a service). You can be like a store page without store front. I'm involve with team and product owner to build our vision of post office on webpage."
    },
    "card-4": {
      "title": "Ascend Commerce: Fullstack (Full time) May 2024 - Present",
      "description": "The Lotus CMS system is a centralized platform for managing products, pricing, promotions, and content across Lotus’s mobile applications and websites, including Gofresh and Hypermarket. The project was initiated to replace a legacy system based on Adobe Magento.",
      "res-1": "Led the frontend development of the CMS Lotus project, overseeing implementation and ensuring alignment with project goals.",
      "res-2": "Provided consultation on user journey design and security best practices; also served as a code reviewer to maintain code quality and consistency.",
      "res-3": "Designed frontend architecture, including UX/UI elements and API integration to support seamless user interaction and system functionality.",
      "res-4": "Diagnosed and resolved production issues, ensuring high availability and performance through proactive monitoring and troubleshooting."
    }
  },
  "expertise": {
    "title": "Software Development",
    "description": "To achieve the most effective outcome for a product, it is essential to select tools that are appropriate for the product's requirements. Additionally, choosing the right algorithm and following best practices are crucial for reaching our goals efficiently. In my opinion, the best solution for tooling is to use Server-Side Rendering (SSR), as it provides strong security and high performance for product development.",
    "quotation": "Use the right tool with the right job."
  },
  "conclusion": {
    "title": "That's not all of my experience",
    "persuade": "Let's go to see it",
    "see-more-project": "See more projects"
  }
}
