{
  "contact": {
    "title": "ช่องทางการติดต่อ",
    "key-title": "Get In Touch",
    "description": "หากสงสัยอย่าเป็นกังวลที่จะติดต่อ!",
    "send-email": "ส่งอีเมล",
    "resume": "Resume"
  },
  "content": {
    "title-1": "ประสบการณ์",
    "title-2": "ความเชี่ยวชาญ"
  },
  "experiences": {
    "card-1": {
      "title": "Fuchsia (Full time) มี.ค. 2023 - ปัจจุบัน",
      "description": "โครงการ GISX เป็นโครงการระบบประกันกลุ่มหลักของภายในบริษัท ตัวโครงการนี้อยู่ในขั้นตอนการผลิต ซึ่งฉันได้มีบทบาทในการทำส่วนหน้าบ้าน (Frontend) ในการผลิต ตัวโครงการมีมูลค่ามากกว่า 500 ล้านบาทและฉันได้เป็นส่วนหนึ่งในการพัฒนา โครงการจัดทำขึ้นเพื่อแก้ปัญหาและปรับเปลี่ยนระบบเก่ามาเป็นระบบใหม่ ผมได้มีส่วนในการวางโครงสร้างพื่นฐานของระบบและนำทีมในการทำ Feature หลักของระบบ เป็นที่ปรึกษาสำหรับภาคธุรกิจข้อจำกัดหรือ Trade off ของระบบให้ suggestion กับฝ่ายธุรกิจ และให้คำปรึกษาในการทำงานเชิงระบบรวมไปถึงการ Review code implementation"
    },
    "card-2": {
      "title": "Shippop (Outsource) ม.ค. 2022 - มี.ค. 2023",
      "description": "Shippop Global เป็น Product รวบรวมการขนส่งจากทั่วมุมโลกให้การขนส่งไปต่างประเทศเป็นเรื่องง่าย ฉันมีบทบาทในการพัฒนาส่วนเว็บไซต์ เราทำงานเป็น Scrum รวบรวมข้อกำหนดจาก PO พัฒนาใน Next Js และสร้าง API Gateway ผ่าน Nextjs โดยใช้ Version Control ของ Azure DevOps และสร้าง CI/CD ที่มีการทดสอบอัตโนมัติโดย Cypress และวางระบบโครงสร้างพื้นฐาน"
    },
    "card-3": {
      "title": "Shippop (Coperation Eudacation) ส.ค. 2021 - พ.ย. 2021",
      "description": "โครงการ All Express เป็นผลิตภัณฑ์ที่ขับเคลื่อนโดยธุรกิจการตลาดหลายระดับ ผลิตภัณฑ์นี้สร้างขึ้นเพื่อการแก้ปัญหาการส่งพัสดุ ผลิตภัณฑ์นี้เป็น POS (แพลตฟอร์มเป็นบริการ) คุณสามารถเป็นเหมือนหน้าร้านได้โดยไม่มีหน้าร้าน ฉันมีส่วนร่วมกับทีมและเจ้าของผลิตภัณฑ์เพื่อสร้างวิสัยทัศน์ของที่ทำการไปรษณีย์บนหน้าเว็บ"
    }
  },
  "expertise": {
    "title": "Software Devlopment",
    "description": "เพื่อให้ได้ผลลัพธ์สูงสุดของผลิตภัณฑ์ จะต้องเลือกเครื่องมือที่เหมาะสมกับผลิตภัณฑ์ รวมถึงการเลือกอัลกอริทึมที่เหมาะสมและแนวทางปฏิบัติที่ดีที่สุดเพื่อบรรลุเป้าหมายของเรา สำหรับทางออกที่ดีที่สุดของฉันในการเลือกเครื่องมือคือการใช้ SSR เพื่อพัฒนาผลิตภัณฑ์ที่ยึดตามความปลอดภัยและประสิทธิภาพสูง",
    "quotation": "Use the right tool with the right job."
  },
  "conclusion": {
    "title": "นั่นไม่ใช่ประสบการณ์ทั้งหมด",
    "persuade": "ไปดูกันเลย",
    "see-more-project": "ดูเพิ่มเติม"
  }
}
