{
  "contact": {
    "title": "ช่องทางการติดต่อ",
    "key-title": "Get In Touch",
    "description": "หากสงสัยอย่าเป็นกังวลที่จะติดต่อ!",
    "send-email": "ส่งอีเมล",
    "resume": "Resume"
  },
  "content": {
    "title-1": "ประสบการณ์",
    "title-2": "ความเชี่ยวชาญ"
  },
  "experiences": {
    "responsibility": "หน้าที่ความรับผิดชอบของผม ได้แก่:",
    "card-1": {
      "title": "MTL: Frontend (Full time) มี.ค. 2023 - ปัจจุบัน",
      "description": "โครงการ GISX เป็นระบบหลักของบริษัทสำหรับบริหารจัดการประกันกลุ่ม และปัจจุบันเปิดใช้งานจริงในระบบ Production แล้ว โดยผมมีบทบาทสำคัญในด้านการพัฒนา Frontend โดยเฉพาะในการวางโครงสร้างพื้นฐานของระบบ โครงการนี้มีมูลค่ากว่า 500 ล้านบาท มีเป้าหมายเพื่อแทนที่ระบบเดิมด้วยโซลูชันที่ทันสมัยและมีประสิทธิภาพมากยิ่งขึ้น",
      "res-1": "ออกแบบและพัฒนา Micro Frontend Architecture โดยใช้ Next.js ร่วมกับ Module Federation ตั้งแต่ขั้นตอน R&D ไปจนถึงการเชื่อมต่อสำเร็จระหว่าง Server และ Client",
      "res-2": "เป็นผู้นำในการพัฒนา Feature หลักด้าน Frontend และทำงานร่วมกับทีมเทคนิคและหน่วยธุรกิจอย่างใกล้ชิด",
      "res-3": "ทำหน้าที่เป็น ที่ปรึกษาทางเทคนิค ให้กับหน่วยธุรกิจ ให้คำแนะนำด้านการตัดสินใจเชิงระบบ การวิเคราะห์ข้อดีข้อเสีย และความเป็นไปได้ของฟีเจอร์ต่าง ๆ",
      "res-4": "เข้าร่วม การประชุมประจำสัปดาห์ (Weekly Sync) เพื่อตรวจสอบโค้ด รักษามาตรฐานคุณภาพ และส่งเสริมแนวทางการเขียนโค้ดที่ดี"
    },
    "card-2": {
      "title": "Shippop: Frontend (Outsource) ม.ค. 2022 - ก.พ. 2023",
      "description": "Shippop Global เป็น Product รวบรวมการขนส่งจากทั่วมุมโลกให้การขนส่งไปต่างประเทศเป็นเรื่องง่าย ผมมีบทบาทในการพัฒนาส่วนเว็บไซต์ เราทำงานเป็น Scrum รวบรวมข้อกำหนดจาก PO พัฒนาใน Next Js และสร้าง API Gateway ผ่าน Nextjs โดยใช้ Version Control ของ Azure DevOps และสร้าง CI/CD ที่มีการทดสอบอัตโนมัติโดย Cypress และวางระบบโครงสร้างพื้นฐาน"
    },
    "card-3": {
      "title": "Shippop: Frontend (Coperation Eudacation) ส.ค. 2021 - พ.ย. 2021",
      "description": "โครงการ All Express เป็นผลิตภัณฑ์ที่ขับเคลื่อนโดยธุรกิจการตลาดหลายระดับ ผลิตภัณฑ์นี้สร้างขึ้นเพื่อการแก้ปัญหาการส่งพัสดุ ผลิตภัณฑ์นี้เป็น POS (แพลตฟอร์มเป็นบริการ) คุณสามารถเป็นเหมือนหน้าร้านได้โดยไม่มีหน้าร้าน ผมมีส่วนร่วมกับทีมและเจ้าของผลิตภัณฑ์เพื่อสร้างวิสัยทัศน์ของที่ทำการไปรษณีย์บนหน้าเว็บ"
    },
    "card-4": {
      "title": "Ascend Commerce: Fullstack (Full time) พ.ค. 2024 - ปัจจุบัน",
      "description": "Lotus CMS เป็นระบบศูนย์กลางสำหรับจัดการข้อมูลสินค้า ราคา โปรโมชั่น และเนื้อหาทั้งหมดในแอปพลิเคชันและเว็บไซต์ของ Lotus รวมถึง Gofresh และ Hypermarket โครงการนี้ถูกพัฒนาขึ้นเพื่อทดแทนระบบเดิมที่ใช้ Adobe Magento",
      "res-1": "เป็นผู้นำในการพัฒนา Frontend ของโครงการ CMS Lotus โดยดูแลกระบวนการพัฒนาและให้มั่นใจว่าสอดคล้องกับเป้าหมายของโครงการ",
      "res-2": "ให้คำปรึกษาในการออกแบบเส้นทางการใช้งานของผู้ใช้ (User Journey) และแนวทางปฏิบัติด้านความปลอดภัย พร้อมทั้งตรวจสอบโค้ดเพื่อรักษาคุณภาพและความสม่ำเสมอ",
      "res-3": "ออกแบบสถาปัตยกรรมของฝั่ง Frontend รวมถึงองค์ประกอบ UX/UI และการเชื่อมต่อ API เพื่อให้การใช้งานของผู้ใช้เป็นไปอย่างราบรื่น",
      "res-4": "วิเคราะห์และแก้ไขปัญหาในระบบ Production เพื่อให้ระบบมีความพร้อมใช้งานสูงและทำงานได้อย่างมีประสิทธิภาพ โดยอาศัยการมอนิเตอร์และการแก้ไขปัญหาเชิงรุก"
    }
  },
  "expertise": {
    "title": "Software Devlopment",
    "description": "เพื่อให้ได้ผลลัพธ์สูงสุดของผลิตภัณฑ์ จะต้องเลือกเครื่องมือที่เหมาะสมกับผลิตภัณฑ์ รวมถึงการเลือกอัลกอริทึมที่เหมาะสมและแนวทางปฏิบัติที่ดีที่สุดเพื่อบรรลุเป้าหมายของเรา สำหรับทางออกที่ดีที่สุดของผมในการเลือกเครื่องมือคือการใช้ SSR เพื่อพัฒนาผลิตภัณฑ์ที่ยึดตามความปลอดภัยและประสิทธิภาพสูง",
    "quotation": "Use the right tool with the right job."
  },
  "conclusion": {
    "title": "นั่นไม่ใช่ประสบการณ์ทั้งหมด",
    "persuade": "ไปดูกันเลย",
    "see-more-project": "ดูเพิ่มเติม"
  }
}
