{
  "title": "My Project",
  "show-case": {
    "title": "PenPals App",
    "role": "Full Stack",
    "viewing": "ดูเพิ่มเติม",
    "description": "PenPals เป็นแอปพลิเคชั่นมือถือ สร้างขึ้นโดย React Native PenPals มีแนวคิดเป็น Interpal หรือ Facebook ที่เราสามารถแชทกับเพื่อน โพสต์กิจกรรม แจ้งเตือน และโซเชียลของเพื่อน แต่ความแตกต่างของ PenPals คือแท็ก แท็กเป็นตัวระบุความชอบส่วนบุคคลเพื่อสร้างความสัมพันธ์ระหว่างกัน"
  },
  "projects": {
    "title": "ผลงานบางส่วน",
    "list": {
      "6": {
        "title": "วิจัยและการออกแบบ Micro Frontend",
        "role": "Frontend",
        "description": "แผนภาพ Micro Frontend ของการวิจัยและการออกแบบ การออกแบบแผนภาพนี้็เป็นการแก้ปัญหาการใช้ Components ซ้ำซ้อนของ Micro Frontend แต่การออกแบบนี้มีเชื่อมต่อที่ซับซ้อนระหว่างไคลเอนต์และเซิร์ฟเวอร์",
        "stack": {
          "0": "Nextjs",
          "1": "Module Federation"
        }
      },
      "0": {
        "title": "All Express",
        "role": "Frontend",
        "description": "All Express เป็น POS รูปแบบธุรกิจคือการตลาดหลายชั้น All Express เป็นร้านค้าสำหรับจัดส่งพัสดุผ่านผู้ให้บริการขนส่งต่างๆ ฉันทำงานร่วมกับหลายทีมในการจัดส่งให้กับเจ้าของผลิตภัณฑ์",
        "stack": {
          "0": "Nextjs",
          "1": "Mui"
        }
      },
      "1": {
        "title": "SpaceX",
        "role": "Frontend",
        "description": "SpaceX เป็นโครงการที่สร้างโดย React และดึง SpaceX API โปรเจคนี้สร้างมาเพื่อการศึกษา",
        "stack": {
          "0": "React"
        }
      },
      "2": {
        "title": "World War I and II",
        "role": "Frontend",
        "description": "สงครามโลกครั้งที่ 1 และ 2 เป็นโครงการเพื่อการตระหนักรู้เกี่ยวกับภัยสงครามและให้ความรู้และลำดับเหตุการณ์ โครงการนี้สร้างขึ้นเพื่อการศึกษา",
        "stack": {
          "0": "HTML",
          "1": "CSS",
          "2": "JS"
        }
      },
      "3": {
        "title": "Tank",
        "role": "Developer",
        "description": "Tank เป็นเกมที่มีกลไกเหมือนกับรถถังของจริง Tank เป็นเกมเล่นคนเดียวและต่อสู้กับบอท คุณสามารถหมุนป้อมปืนเพื่อยิงจุดอ่อนของรถถัง เช่น ด้านหลังหรือด้านข้าง แต่ด้านหน้ามีเกราะขนาดใหญ่ไม่สามารถยิงเข้าได้ง่าย",
        "stack": {
          "0": "JAVA"
        }
      },
      "4": {
        "title": "Religion",
        "role": "Frontend",
        "description": "เกี่ยวกับเกม คุณเป็นอัศวินในเกมและเปลี่ยนผู้ที่นับถือศาสนาให้เป็นศรัทธาของราชินีโดยทำร้ายพวกเขา นั้นดูน่าไม่ยินดี แต่คุณจะรู้ว่าเกมนี้มีทางเลือก คุณเพียงแค่ต้องเล่นจนจบ",
        "stack": {
          "0": "JS"
        }
      },
      "5": {
        "title": "Snake",
        "role": "Frontend",
        "description": "กินแอปเปิ้ลและโตขึ้น",
        "stack": {
          "0": "JS"
        }
      }
    }
  }
}
